#include <iostream>

using namespace std;
void main()

/*{   // №1 Надпись
	cout << "   \"\To Be \n";
	cout << "       or not\n";
	cout << "           to be...\"\ \n";
	cout << "                      / Shakespeare /   \n" << endl;
}*/

/*{   // №2 Надпись
	cout << "I love C++\n";
	cout << "\tI love C++\n";
	cout << "\t\tI love C++\n";
	cout << "\t\t\tI love C++\n";
	cout << "\t\t\t\tI love C++\n" << endl;
}*/

/*{   // №3 Надпись
	cout << "\'\\t\', \'\\n\', \'\\\\\', \'\\\'\', \'\\\"\'." << endl;
}*/

/*{   // №4 Вывести код
	cout << "#include <iostream>\n";
	cout << "using namespace std;\n";
	cout << "\n";
	cout << "void main()\n";
	cout << "{\n";
	cout << "\tsystem \(\"titletask 3\"\);\n";
	cout << "\tcout << \"top\ secret information!\"\;\n";
	cout << "}\n" << endl;
}*/

/*{   // №5 Календарь
	setlocale(LC_ALL, "Rus");
	cout << "       СЕНТЯБРЬ\n";
	cout << "\n";
	cout << " ПН ВТ СР ЧТ ПТ СБ ВС\n";
	cout << "                    1\n";
	cout << "  2  3  4  5  6  7  8\n";
	cout << "  9 10 11 12 13 14 15\n";
	cout << " 16 17 18 19 20 21 22\n";
	cout << " 23 24 25 26 27 28 29\n";
	cout << " 30\n" << endl;
}*/

/*{   // №6 Домик
	cout << "                           )     # \n";
	cout << "                          ( )   # # \n";
	cout << "                         ( ))  #   # \n";
	cout << "                         #### #     # \n";
	cout << "                         #  ##       # \n";
	cout << "                         #  #         # \n";
	cout << "                         # #           # \n";
	cout << "                         ##             # \n";
	cout << "                         #               # \n";
	cout << "                        #                 # \n";
	cout << "                       #                   # \n";
	cout << "                      #                     # \n";
	cout << "                     #                       # \n";
	cout << "                    #                         # \n";
	cout << "                   ############################# \n";
	cout << "                   #                           # \n";
	cout << "                   #                           # \n";
	cout << "                   #            ############   # \n";
	cout << "                   #            #   #  #   #   # \n";
	cout << "                   #  ######    #  #    #  #   # \n";
	cout << "                   #  #    #    # #      # #   # \n";
	cout << "                   #  #    #    ############   # \n";
	cout << "                   #  # #  #                   # \n";
	cout << "                   #  #    #   ##  ##  ##  ##  # \n";
	cout << "       #       #   #  #    #   ##############  #       #       #\n";
	cout << "   #   #   #   #   #  #    #   ##  ##  ##  ##  #   #   #   #   #  \n";
	cout << " # # # # # # # # # ############################# # # # # # # # # # \n" << endl;
}*/

/*{   // №7 Генеалогические дерево
	setlocale(LC_ALL, "Rus");

	cout << "                                  Я\n";
	cout << "                             Данил Чурко\n";
	cout << "                                  *\n";
	cout << "                                  *\n";
	cout << "                                 * *\n";
	cout << "                                *   *\n";
	cout << "                               *     *\n";
	cout << "                       Мама                 Папа\n";
	cout << "                 Назаренко Ольга       Чурко Александр\n";
	cout << "                      *                           *\n";
	cout << "                      *                           *\n";
	cout << "                     * *                         * *\n";
	cout << "                    *   *                       *   *\n";
	cout << "                   *     *                     *     *\n";
	cout << "             Дедушка   Бабушка             Дедушка    Бабушка\n";
	cout << "  Василий Николаевич  Лидия Павловна  Олексей Петрович  Мария Викторовна\n" << endl;
}*/

/*{   // №8 Свое имя
	cout << "  *******             ****   **      **   **      **           ****\n";
	cout << "  *******            *****   **      **   **     ***          *****\n";
	cout << "  **   **           **  **   **      **   **    ****         **  **\n";
	cout << "  **   **          **   **   **      **   **   ** **        **   **\n";
	cout << "  **   **         ********   **********   **  **  **       **    **\n";   
	cout << "***********      *********   **      **   ** **   **      **     **\n";
	cout << "***********     **      **   **      **   ****    **     **      **\n";
	cout << "**      ***    **       **   **      **   ***     **    **       **\n";
	cout << "**      ***   **        **   **      **   **      **   **        **\n" << endl;
}*/

/*{   // №9 Созвездие
cout << "                         *\n";
cout << "   *\n";
cout << "\n";
cout << "\n";
cout << "                                         *\n";
cout << "\n";
cout << "\n";
cout << "\n";
cout << "                                                           *\n";
cout << "                                                                                          *\n";
cout << "\n";
cout << "\n";
cout << "\n";
cout << "\n";
cout << "                                                              *\n";
cout << "\n";
cout << "                                                                                      *\n" << endl;
}*/

/*{   // №10 Резюме
setlocale(LC_ALL, "Rus");

cout << "Имя: Данил Чурко Александрович\n";
cout << "Д.Р.: 2 декабря 2000 года (18 лет)\n";
cout << "Образование: Полное среднее. На данный момент обучаюсь в ОТУ Шаг по специальности разработка программного обеспечения.\n(Выпускной в 2023)\n";
cout << "Hard skills: Adobe PS, IL, PP, AE. Microsoft Word, Excel, PP.\n";
cout << "Soft skills: Инициативность, ответственность, вовлеченность и сосредоточенность на работе.\nУмение находить не очевидные ответы на очевидные вопросы. Так же хорошо коммуницирую с людьми в любом вопросе.\n";
cout << "\n";
cout << "Номер телефона для связи: +38(096)350-12-94\n";
cout << "Почта: danil.churko@gmail.com\n";
cout << "Месенджер: t.me/danil.churko\n" << endl;
}*/
